app/views/notifications/_notification.html.erb

        <div class="p.text-muted.mb-0">
          <%= Comment.find_by(id: notification.comment_id)&.comment %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]