app/views/ranks/index.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["LIMIT", 1]]
---
            <div id="like-icon-post-<%= post.id.to_s %>">
             <% if post.liked_by(current_user).present? %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]
---
           <div id="comment-post-<%= post.id.to_s %>">
            <% post.comments.each do |comment| %>