app/views/posts/_show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
           <div id="comment-post-<%= @post.id.to_s %>">
            <% @post.comments.each do |comment| %>