app/views/posts/show.html.erb

           <div id="comment-post-<%= @post.id.to_s %>">
            <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]