app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "実践済み(/・ω・)/"], ["post_id", 1], ["user_id", 2], ["created_at", "2021-09-21 14:47:34.405106"], ["updated_at", "2021-09-21 14:47:34.405106"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "comment_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 2], ["visited_id", 1], ["post_id", 1], ["comment_id", 1], ["action", "comment"], ["created_at", "2021-09-21 14:47:34.416838"], ["updated_at", "2021-09-21 14:47:34.416838"]]
---
  def create
    @comment = Comment.new(comment_params)
    @post = @comment.post
    if @comment.save
      @post.create_notification_comment!(current_user, @comment.id)