app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 6], ["user_id", 1], ["created_at", "2021-09-28 14:04:02.409836"], ["updated_at", "2021-09-28 14:04:02.409836"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "action", "checked", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 1], ["post_id", 1], ["action", "like"], ["checked", 1], ["created_at", "2021-09-21 14:46:28.170966"], ["updated_at", "2021-09-21 14:46:28.170966"]]
---
 def create
  @like = current_user.likes.build(like_params)
  @post = @like.post

  if @like.save
  post = Post.find(params[:post_id])
  post.create_notification_like!(current_user)

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 7]]
---
 def destroy
  @like = Like.find_by(id: params[:id])
  @post = @like.post
  @like.destroy