app/controllers/notifications_controller.rb

UPDATE "notifications" SET "checked" = ?, "updated_at" = ? WHERE "notifications"."id" = ?  [["checked", 1], ["updated_at", "2021-09-22 10:28:07.149962"], ["id", 3]]
---
  def index
    @notifications = current_user.passive_notifications
    @notifications = current_user.passive_notifications.page(params[:page]).per(20)
    @notifications.where(checked: false).each do |notification|
      notification.update_attributes(checked: true)