app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @posts = Post.limit(10).order('created_at DESC')

INSERT INTO "posts" ("title", "post_image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post=current_user.posts.build(post_params)
    # =以下2文を含む
    # @post = Post.new(post_params)
    # @post.user_id = current_user.id
    if @post.save