app/controllers/ranks_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @posts = Post.limit(10).order('created_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (?, ?, ?)  [["id", 6], ["id", 7], ["id", 9]]
---
    def set_post
      @post = Post.find(params[:id])