app/controllers/relationships_controller.rb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 1], ["follow_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 2], ["action", "follow"], ["created_at", "2021-09-22 10:32:57.212834"], ["updated_at", "2021-09-22 10:32:57.212834"]]
INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["follow_id", 2], ["created_at", "2021-09-22 10:32:57.201743"], ["updated_at", "2021-09-22 10:32:57.201743"]]
---
  def create
    @user = User.find(params[:relationship][:following_id])
    current_user.follow(@user)
    # ここから
    @user.create_notification_follow!(current_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:follow_id])