app/models/post.rb

  def liked_by(user)
    Like.find_by(user_id: user.id, post_id: id)
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]

  def create_notification_like!(current_user)
    # すでに「いいね」されているか検索
    temp = Notification.where(["visitor_id = ? and visited_id = ? and post_id = ? and action = ? ", current_user.id, user_id, id, 'like'])
    # いいねされていない場合のみ、通知レコードを作成
    if temp.blank?
      notification = current_user.active_notifications.new(
        post_id: id,
        visited_id: user_id,
        action: 'like'
      )
      # 自分の投稿に対するいいねの場合は、通知済みとする
      if notification.visitor_id == notification.visited_id
        notification.checked = true
      end
      notification.save if notification.valid?
---
SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 1 and visited_id = 1 and post_id = 1 and action = 'like' ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "action", "checked", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 1], ["post_id", 1], ["action", "like"], ["checked", 1], ["created_at", "2021-09-21 14:46:28.170966"], ["updated_at", "2021-09-21 14:46:28.170966"]]

    def create_notification_comment!(current_user, comment_id)
    # 自分以外にコメントしている人をすべて取得し、全員に通知を送る
    temp_ids = Comment.select(:user_id).where(post_id: id).where.not(user_id: current_user.id).distinct
    temp_ids.each do |temp_id|
---
SELECT DISTINCT "comments"."user_id" FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."user_id" != ?  [["post_id", 1], ["user_id", 2]]

  def save_notification_comment!(current_user, comment_id, visited_id)
    # コメントは複数回することが考えられるため、１つの投稿に複数回通知する
    notification = current_user.active_notifications.new(
      post_id: id,
      comment_id: comment_id,
      visited_id: visited_id,
      action: 'comment'
    )
    # 自分の投稿に対するコメントの場合は、通知済みとする
    if notification.visitor_id == notification.visited_id
      notification.checked = true
    end
    notification.save if notification.valid?
---
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "comment_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["visitor_id", 2], ["visited_id", 1], ["post_id", 1], ["comment_id", 1], ["action", "comment"], ["created_at", "2021-09-21 14:47:34.416838"], ["updated_at", "2021-09-21 14:47:34.416838"]]