app/models/user.rb

SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 1 and visited_id = 2 and action = 'follow' ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visitor_id", "visited_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 2], ["action", "follow"], ["created_at", "2021-09-22 10:32:57.212834"], ["updated_at", "2021-09-22 10:32:57.212834"]]
---
  def create_notification_follow!(current_user)
    temp = Notification.where(["visitor_id = ? and visited_id = ? and action = ? ",current_user.id, id, 'follow'])
    if temp.blank?
      notification = current_user.active_notifications.new(
        visited_id: id,
        action: 'follow'
      )
      notification.save if notification.valid?